БИТУправление_медицинским_центром_демо/src/InformationRegisters/ОшибкиОбменовДанными/ОшибкиОбменовДанными.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОшибкиОбменовДанными</name>
  <comment>(бит)</comment>
  <resources>
    <name>Обработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.Заявка</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ОшибкиОбменовДанными/Forms/ФормаРазбораКонфликтов/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьОбъект(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ОткрытьЗначение(ТекущиеДанные.Объект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьОбработанным(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ОтметитьОбработаннымНаСервере(ТекущиеДанные.Объект);
		Элементы.Список.Обновить();
		Оповестить("ОбработанКонфликтРБД");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ОтметитьОбработаннымНаСервере(Объект)

	Запись = РегистрыСведений.ОшибкиОбменовДанными.СоздатьМенеджерЗаписи();
	Запись.Объект = Объект;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.Обработан = Истина;
		Запись.ДатаОбработки = ТекущаяДата();
		Запись.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
